#+ASSIGNMENT: nlr-1
#+POINTS: 3
#+CATEGORY: homework
#+RUBRIC: (("technical" . 0.7) ("presentation" . 0.3))
#+DUEDATE: [2015-10-22 Thu 23:59]

The reaction $A \rightarrow B + C$ was carried out in a batch reactor. The following data was acquired. Use nonlinear regression to find the reaction order and rate constant with 95% confidence intervals.

#+BEGIN_SRC python
import numpy as np
from scipy.integrate import odeint
from pycse import nlinfit

t = np.array([0, 5, 9, 15, 22, 30, 40, 60], dtype=np.float)  # minutes
Ca = np.array([2, 1.6, 1.35, 1.1, 0.87, 0.70, 0.53, 0.35], dtype=np.float) # mol / L


Ca0 = 2.0

def dCadt(Ca, t, k, alpha):
    return -k * Ca**alpha

def model(t, k, alpha):
    Ca = odeint(dCadt, Ca0, t, args=(k, alpha))
    return Ca[:,0]  # must return a 1D array here

guess = [0.01, 2.0] # from the linear regression

p, pint, se = nlinfit(model, t, Ca, guess, 0.05)

k, alpha = np.array(pint)

print('alpha = {} at the 95% confidence level'.format(alpha))
print('k = {0} at the 95% confidence level'.format(k))
#+END_SRC

#+RESULTS:
: alpha = [ 1.47508132  1.57937855] at the 95% confidence level
: k = [ 0.03238295  0.03348392] at the 95% confidence level

# There would be a message showing that excess work done if another initial guess was chosen, yet the answer was the same.
#+TURNED-IN: Thu Oct 22 22:28:16 2015

* Grade
#+technical: A
#+presentation: A-
#+GRADE: 0.885
#+GRADED-BY: Irem Sen
